{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "4f2a9396",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd \n",
    "from datetime import datetime\n",
    "import os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6fd7ecdc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'0.0.3'"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import langchain_community\n",
    "langchain_community.__version__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "e4ffbd19",
   "metadata": {},
   "outputs": [],
   "source": [
    "data_filename = r'./data/Presales Genie data.csv'\n",
    "\n",
    "df = pd.read_csv(data_filename)\n",
    "\n",
    "df['Date of Submission'] = pd.to_datetime(df['Date of Submission'], format='%d-%b-%y').dt.date"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "b1b9ba31",
   "metadata": {},
   "outputs": [],
   "source": [
    "df.columns = ['Customer', 'Pursuit', 'Areas_covered', 'tool_name', 'Cyber_Deal_size',\n",
    "       'team_size', 'Presale_SPOC', 'Date_of_Submission', 'File_Storage']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c3bdffe1",
   "metadata": {
    "collapsed": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Downloading neo4j-5.15.0.tar.gz (196 kB)\n",
      "     ---------------------------------------- 0.0/196.5 kB ? eta -:--:--\n",
      "     --- --------------------------------- 20.5/196.5 kB 682.7 kB/s eta 0:00:01\n",
      "     ------------- ----------------------- 71.7/196.5 kB 991.0 kB/s eta 0:00:01\n",
      "     -------------------------------------- 196.5/196.5 kB 2.4 MB/s eta 0:00:00\n",
      "  Installing build dependencies: started\n",
      "  Installing build dependencies: finished with status 'done'\n",
      "  Getting requirements to build wheel: started\n",
      "  Getting requirements to build wheel: finished with status 'done'\n",
      "  Installing backend dependencies: started\n",
      "  Installing backend dependencies: finished with status 'done'\n",
      "  Preparing metadata (pyproject.toml): started\n",
      "  Preparing metadata (pyproject.toml): finished with status 'done'\n",
      "Requirement already satisfied: pytz in c:\\users\\admin2\\anaconda3\\envs\\openai\\lib\\site-packages (from neo4j) (2023.3.post1)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (pyproject.toml): started\n",
      "  Building wheel for neo4j (pyproject.toml): finished with status 'done'\n",
      "  Created wheel for neo4j: filename=neo4j-5.15.0-py3-none-any.whl size=272510 sha256=76ae9a1e07742f7703214b82cc9e0b23ace1da3415bb73b86a478ee9217ba6f9\n",
      "  Stored in directory: c:\\users\\admin2\\appdata\\local\\pip\\cache\\wheels\\b5\\1c\\7e\\47445652c3ff85f3f13d0940bd0e40759712f374ef26bfb5f1\n",
      "Successfully built neo4j\n",
      "Installing collected packages: neo4j\n",
      "Successfully installed neo4j-5.15.0\n"
     ]
    }
   ],
   "source": [
    "!pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "7214c395",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase, basic_auth"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "96dbd1be",
   "metadata": {},
   "outputs": [],
   "source": [
    "user  = 'neo4j'\n",
    "password = os.getenv('NEO4J_PASSWORD')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "e765bd6c",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(user, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "d9bd4d4d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import_folder = r'C:\\Users\\admin2\\.Neo4jDesktop\\relate-data\\dbmss\\dbms-2aa10f3a-a03f-4da1-8f92-6e85a6b71017\\import\\\\'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "11a8175c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Customer</th>\n",
       "      <th>Pursuit</th>\n",
       "      <th>Areas_covered</th>\n",
       "      <th>tool_name</th>\n",
       "      <th>Cyber_Deal_size</th>\n",
       "      <th>team_size</th>\n",
       "      <th>Presale_SPOC</th>\n",
       "      <th>Date_of_Submission</th>\n",
       "      <th>File_Storage</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cust1</td>\n",
       "      <td>RFP</td>\n",
       "      <td>PAM, IAM, Appsec, SOC, VM</td>\n",
       "      <td>CyberArk, TIM TDI, Burp Suite, SPLUNK, Rapid 7</td>\n",
       "      <td>9m</td>\n",
       "      <td>55</td>\n",
       "      <td>AJ</td>\n",
       "      <td>2023-01-01</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Cust2</td>\n",
       "      <td>RFP</td>\n",
       "      <td>PAM</td>\n",
       "      <td>CA-PAM</td>\n",
       "      <td>600k</td>\n",
       "      <td>6</td>\n",
       "      <td>KP</td>\n",
       "      <td>2023-01-02</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Cust3</td>\n",
       "      <td>RFP</td>\n",
       "      <td>GRC</td>\n",
       "      <td>Archer</td>\n",
       "      <td>200k</td>\n",
       "      <td>3</td>\n",
       "      <td>VK</td>\n",
       "      <td>2023-01-03</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Cust4</td>\n",
       "      <td>Proactive</td>\n",
       "      <td>IAM</td>\n",
       "      <td>TIM TDI</td>\n",
       "      <td>120k</td>\n",
       "      <td>2</td>\n",
       "      <td>AJ</td>\n",
       "      <td>2023-01-04</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Cust5</td>\n",
       "      <td>RFP</td>\n",
       "      <td>EDR</td>\n",
       "      <td>crowdstrike</td>\n",
       "      <td>230k</td>\n",
       "      <td>4</td>\n",
       "      <td>KP</td>\n",
       "      <td>2023-01-05</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>Cust97</td>\n",
       "      <td>RFP</td>\n",
       "      <td>Forensics</td>\n",
       "      <td>CADO</td>\n",
       "      <td>1.5m</td>\n",
       "      <td>12</td>\n",
       "      <td>AJ</td>\n",
       "      <td>2023-04-07</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Cust98</td>\n",
       "      <td>RFI</td>\n",
       "      <td>EDR</td>\n",
       "      <td>crowdstrike</td>\n",
       "      <td>3m</td>\n",
       "      <td>22</td>\n",
       "      <td>KP</td>\n",
       "      <td>2023-04-08</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>Cust99</td>\n",
       "      <td>RFQ</td>\n",
       "      <td>PT</td>\n",
       "      <td>Burp Suite</td>\n",
       "      <td>300k</td>\n",
       "      <td>2</td>\n",
       "      <td>VK</td>\n",
       "      <td>2023-04-09</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>Cust100</td>\n",
       "      <td>RFI</td>\n",
       "      <td>IAM</td>\n",
       "      <td>TIM TDI</td>\n",
       "      <td>140k</td>\n",
       "      <td>1</td>\n",
       "      <td>AJ</td>\n",
       "      <td>2023-04-10</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>Cust101</td>\n",
       "      <td>RFI</td>\n",
       "      <td>Appsec</td>\n",
       "      <td>AppScan</td>\n",
       "      <td>500k</td>\n",
       "      <td>4</td>\n",
       "      <td>KP</td>\n",
       "      <td>2023-04-11</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>101 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Customer    Pursuit              Areas_covered  \\\n",
       "0      Cust1        RFP  PAM, IAM, Appsec, SOC, VM   \n",
       "1      Cust2        RFP                       PAM    \n",
       "2      Cust3        RFP                        GRC   \n",
       "3      Cust4  Proactive                        IAM   \n",
       "4      Cust5        RFP                        EDR   \n",
       "..       ...        ...                        ...   \n",
       "96    Cust97        RFP                  Forensics   \n",
       "97    Cust98        RFI                        EDR   \n",
       "98    Cust99        RFQ                         PT   \n",
       "99   Cust100        RFI                        IAM   \n",
       "100  Cust101        RFI                     Appsec   \n",
       "\n",
       "                                          tool_name Cyber_Deal_size  \\\n",
       "0    CyberArk, TIM TDI, Burp Suite, SPLUNK, Rapid 7              9m   \n",
       "1                                            CA-PAM            600k   \n",
       "2                                            Archer            200k   \n",
       "3                                           TIM TDI            120k   \n",
       "4                                       crowdstrike            230k   \n",
       "..                                              ...             ...   \n",
       "96                                             CADO            1.5m   \n",
       "97                                      crowdstrike              3m   \n",
       "98                                       Burp Suite            300k   \n",
       "99                                          TIM TDI            140k   \n",
       "100                                         AppScan            500k   \n",
       "\n",
       "     team_size Presale_SPOC Date_of_Submission             File_Storage  \n",
       "0           55           AJ         2023-01-01  www.abcdefghasdasda.com  \n",
       "1            6           KP         2023-01-02  www.abcdefghasdasda.com  \n",
       "2            3           VK         2023-01-03  www.abcdefghasdasda.com  \n",
       "3            2           AJ         2023-01-04  www.abcdefghasdasda.com  \n",
       "4            4           KP         2023-01-05  www.abcdefghasdasda.com  \n",
       "..         ...          ...                ...                      ...  \n",
       "96          12           AJ         2023-04-07  www.abcdefghasdasda.com  \n",
       "97          22           KP         2023-04-08  www.abcdefghasdasda.com  \n",
       "98           2           VK         2023-04-09  www.abcdefghasdasda.com  \n",
       "99           1           AJ         2023-04-10  www.abcdefghasdasda.com  \n",
       "100          4           KP         2023-04-11  www.abcdefghasdasda.com  \n",
       "\n",
       "[101 rows x 9 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "4fe9a8ec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Pursuit\n",
       "RFP          78\n",
       "Proactive    19\n",
       "RFI           3\n",
       "RFQ           1\n",
       "Name: count, dtype: int64"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.Pursuit.value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "9445c47b",
   "metadata": {},
   "outputs": [],
   "source": [
    "raw_tools = df.tool_name.unique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "f4b0f929",
   "metadata": {},
   "outputs": [],
   "source": [
    "tools = []\n",
    "for tool in raw_tools:\n",
    "    tools.extend([t.strip() for t in tool.split(',')])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "0e2778cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "41\n",
      "32\n"
     ]
    }
   ],
   "source": [
    "print (len(tools))\n",
    "tools = list(set(tools))\n",
    "print (len(tools))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "3479364e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Trend Micro',\n",
       " 'Log Rhythm',\n",
       " 'McAfee',\n",
       " 'Thales Vormetric',\n",
       " 'Veracode',\n",
       " 'CyberArk',\n",
       " 'Azure',\n",
       " 'Okta',\n",
       " 'SPLUNK',\n",
       " 'AWS',\n",
       " 'Trend micro',\n",
       " 'CDS',\n",
       " 'AppScan',\n",
       " 'TIM TDI',\n",
       " 'crowdstrike',\n",
       " 'Venafi',\n",
       " 'Archer',\n",
       " 'Identifence',\n",
       " 'Qradar',\n",
       " 'Beyondtrust',\n",
       " 'GCP',\n",
       " 'Sentinel',\n",
       " 'CA-PAM',\n",
       " 'HP Webinspect',\n",
       " 'Burp Suite',\n",
       " 'Zscaler',\n",
       " 'Fireeye',\n",
       " 'M365',\n",
       " 'Nessus',\n",
       " 'CADO',\n",
       " 'Rapid 7',\n",
       " 'Checkmarx']"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "tools"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "0021acde",
   "metadata": {},
   "outputs": [],
   "source": [
    "raw_areas = df.Areas_covered.unique()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "70b289ea",
   "metadata": {},
   "outputs": [],
   "source": [
    "areas = []\n",
    "for area in raw_areas:\n",
    "    areas.extend([t.strip() for t in area.split(',')])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "3923ab4e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "33\n",
      "19\n"
     ]
    }
   ],
   "source": [
    "print (len(areas))\n",
    "areas = list(set(areas))\n",
    "print (len(areas))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "53804e79",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['SOC build',\n",
       " 'AV',\n",
       " 'GRC',\n",
       " 'VM',\n",
       " 'PAM',\n",
       " 'Forensics',\n",
       " 'Appsec',\n",
       " 'IAM',\n",
       " 'HSM',\n",
       " 'L2',\n",
       " 'certificate management',\n",
       " 'SOC L1',\n",
       " 'Cloud Security',\n",
       " 'EDR',\n",
       " 'IR',\n",
       " 'SOC',\n",
       " 'network security',\n",
       " 'M365',\n",
       " 'PT']"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "areas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d048e128",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Customer</th>\n",
       "      <th>Pursuit</th>\n",
       "      <th>Areas_covered</th>\n",
       "      <th>tool_name</th>\n",
       "      <th>Cyber_Deal_size</th>\n",
       "      <th>team_size</th>\n",
       "      <th>Presale_SPOC</th>\n",
       "      <th>Date_of_Submission</th>\n",
       "      <th>File_Storage</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Cust1</td>\n",
       "      <td>RFP</td>\n",
       "      <td>PAM, IAM, Appsec, SOC, VM</td>\n",
       "      <td>CyberArk, TIM TDI, Burp Suite, SPLUNK, Rapid 7</td>\n",
       "      <td>9m</td>\n",
       "      <td>55</td>\n",
       "      <td>AJ</td>\n",
       "      <td>2023-01-01</td>\n",
       "      <td>www.abcdefghasdasda.com</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Customer Pursuit              Areas_covered  \\\n",
       "0    Cust1     RFP  PAM, IAM, Appsec, SOC, VM   \n",
       "\n",
       "                                        tool_name Cyber_Deal_size  team_size  \\\n",
       "0  CyberArk, TIM TDI, Burp Suite, SPLUNK, Rapid 7              9m         55   \n",
       "\n",
       "  Presale_SPOC Date_of_Submission             File_Storage  \n",
       "0           AJ         2023-01-01  www.abcdefghasdasda.com  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[df.Customer=='Cust1']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c1b87c0e",
   "metadata": {},
   "outputs": [],
   "source": [
    "output_filename = import_folder+'Pursuits.csv'\n",
    "df.to_csv(output_filename)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "fbfc50c3",
   "metadata": {},
   "outputs": [],
   "source": [
    "output_filename = import_folder + 'Areas.csv'\n",
    "pd.DataFrame({'Area':areas}).to_csv(output_filename, index = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "f8d058f5",
   "metadata": {},
   "outputs": [],
   "source": [
    "output_filename = import_folder + 'Tools.csv'\n",
    "pd.DataFrame({'Tool':tools}).to_csv(output_filename, index = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "db38a92f",
   "metadata": {},
   "outputs": [],
   "source": [
    "output_filename = import_folder + 'Customers.csv'\n",
    "pd.DataFrame({'Customer':df.Customer}).to_csv(output_filename, index = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4dc20c7a",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Customers.csv\") yield map as row with row\n",
    "MERGE (a:Customer {name:row.Customer})\n",
    "Added 101 labels, created 101 nodes, set 101 properties, completed after 32 ms."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3e389dd3",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Tools.csv\") yield map as row with row\n",
    "MERGE (a:Tool {name:row.Tool})\n",
    "Added 32 labels, created 32 nodes, set 32 properties, completed after 26 ms."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "88c388c2",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Areas.csv\") yield map as row with row\n",
    "MERGE (a:Area {name:row.Area})\n",
    "Added 19 labels, created 19 nodes, set 19 properties, completed after 278 ms."
   ]
  },
  {
   "cell_type": "raw",
   "id": "d11c3302",
   "metadata": {},
   "source": [
    "CALL apoc.load.csv(\"file://Pursuits.csv\") yield map as row with row\n",
    "MERGE (a:Pursuit {type:row.Pursuit, ID:row.ID, Date_of_Submission:row.Date_of_Submission, File_Storage:row.File_Storage, team_size:row.team_size, Cyber_Deal_size:row.Cyber_Deal_size})\n",
    "Added 101 labels, created 101 nodes, set 606 properties, completed after 17 ms."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9bdcdc5b",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Pursuits.csv\") yield map as row with row\n",
    "MATCH (p:Pursuit {ID:row.ID})\n",
    "set p.Date_of_Submission =  datetime(row.Date_of_Submission)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "64f99de7",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Pursuits.csv\") yield map as row with row\n",
    "MATCH (p:Pursuit {ID:row.ID})\n",
    "set p.team_size =  toInteger(row.team_size)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "25847398",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Pursuits.csv\") yield map as row with row\n",
    "WITH split(row.tool_name, ',') AS tools, row\n",
    "UNWIND tools AS tool with tool, row\n",
    "MATCH (t:Tool {name: TRIM(tool)})\n",
    "MATCH (p:Pursuit {ID:row.ID})\n",
    "MERGE (p)-[:USES_TOOL]->(t)\n",
    "Created 109 relationships, completed after 46 ms."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "66b147a1",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Pursuits.csv\") yield map as row with row\n",
    "MATCH (p:Pursuit {ID:row.ID})\n",
    "WITH split(row.Areas_covered, ',') AS areas, p\n",
    "UNWIND areas AS area\n",
    "with area , p\n",
    "MATCH (a:Area {name:TRIM(area)})\n",
    "MERGE (p)-[:AREA_COVERED]->(a)\n",
    "Created 117 relationships, completed after 110 ms."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a31a00e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "CALL apoc.load.csv(\"file://Pursuits.csv\") yield map as row with row\n",
    "MATCH (p:Pursuit {ID:row.ID})\n",
    "MATCH (c:Customer {name:row.Customer})\n",
    "MERGE (c)-[:PURSUES]->(p)\n",
    "Created 101 relationships, completed after 49 ms."
   ]
  },
  {
   "cell_type": "raw",
   "id": "7bd6bbf1",
   "metadata": {},
   "source": [
    "node type 'Pursuit' type is in the column, give it an id\n",
    "properties: type (col Pursuit), Cyber_Deal_size, team_size, date_of_submission, file_storage\n",
    "node Customer name property\n",
    "node Area in Areas_covered. relationship pursuit -[area_covered]->area\n",
    "node tool (tool_name) relationship pursuit -[uses_tool] -> tool\n",
    "node Customer relationship Customer -[PURSUES]-> Pursuit"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "ec7491f7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['Customer', 'Pursuit', 'Areas_covered', 'tool_name', 'Cyber_Deal_size',\n",
       "       'team_size', 'Presale_SPOC', 'Date_of_Submission', 'File_Storage'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "7891f3d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.graphs import Neo4jGraph\n",
    "from langchain.prompts import PromptTemplate\n",
    "import os\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ead76927",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=\"bolt://localhost:7687\", \n",
    "    username=\"neo4j\", \n",
    "    password=password)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "2dc0d1ec",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0, model=\"gpt-4\"), graph=graph, \n",
    "    verbose=True, \n",
    "    top_k = 100\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "932ad90d",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_direct = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0, model=\"gpt-4\"), graph=graph, \n",
    "    verbose=True, \n",
    "    return_direct=True,\n",
    "    top_k = 100\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "7d3d8f3d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Customer {name: 'Cust36'})-[:PURSUES]->(:Pursuit)-[:USES_TOOL]->(t:Tool)<-[:USES_TOOL]-(:Pursuit)<-[:PURSUES]-(otherCustomers:Customer)\n",
      "WHERE c <> otherCustomers\n",
      "RETURN DISTINCT otherCustomers.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'otherCustomers.name': 'Cust64'}, {'otherCustomers.name': 'Cust99'}, {'otherCustomers.name': 'Cust1'}, {'otherCustomers.name': 'Cust67'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The other customers using the same tools as Customer Cust36 are Cust64, Cust99, Cust1, and Cust67.'"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"\"\"\n",
    "For the Customer Cust36 find other Customers using the same tool(s).\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "b8321ace",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (c:Customer {name: 'Cust46'})-[:PURSUES]->(:Pursuit)-[:USES_TOOL]->(t:Tool)<-[:USES_TOOL]-(:Pursuit)<-[:PURSUES]-(otherCustomers:Customer)\n",
      "WHERE c <> otherCustomers\n",
      "RETURN DISTINCT otherCustomers.name\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "output = chain_direct.run(\"\"\"\n",
    "For the Customer Cust46 find other Customers using the same tool(s).\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "87288153",
   "metadata": {},
   "outputs": [],
   "source": [
    "answer = ''\n",
    "for o in output:\n",
    "    answer += list(o.values())[0]\n",
    "    answer += ', '"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "f091f3cd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Cust50, Cust53, Cust45, Cust13, Cust57, '"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "answer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "7c3d51f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Pursuit)-[:USES_TOOL]->(t:Tool) \n",
      "WHERE p.Date_of_Submission = 'April 11th 2023' \n",
      "RETURN t.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I'm sorry, but I don't have the information to answer that question.\""
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"\"\"\n",
    "What tools are used in the Pursuit submitted on April 11th 2023?\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "id": "7bff5fe6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (t:Tool) RETURN t.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'t.name': 'Trend Micro'}, {'t.name': 'Log Rhythm'}, {'t.name': 'McAfee'}, {'t.name': 'Thales Vormetric'}, {'t.name': 'Veracode'}, {'t.name': 'CyberArk'}, {'t.name': 'Azure'}, {'t.name': 'Okta'}, {'t.name': 'SPLUNK'}, {'t.name': 'AWS'}, {'t.name': 'Trend micro'}, {'t.name': 'CDS'}, {'t.name': 'AppScan'}, {'t.name': 'TIM TDI'}, {'t.name': 'crowdstrike'}, {'t.name': 'Venafi'}, {'t.name': 'Archer'}, {'t.name': 'Identifence'}, {'t.name': 'Qradar'}, {'t.name': 'Beyondtrust'}, {'t.name': 'GCP'}, {'t.name': 'Sentinel'}, {'t.name': 'CA-PAM'}, {'t.name': 'HP Webinspect'}, {'t.name': 'Burp Suite'}, {'t.name': 'Zscaler'}, {'t.name': 'Fireeye'}, {'t.name': 'M365'}, {'t.name': 'Nessus'}, {'t.name': 'CADO'}, {'t.name': 'Rapid 7'}, {'t.name': 'Checkmarx'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The names of all the tools are Trend Micro, Log Rhythm, McAfee, Thales Vormetric, Veracode, CyberArk, Azure, Okta, SPLUNK, AWS, CDS, AppScan, TIM TDI, Crowdstrike, Venafi, Archer, Identifence, Qradar, Beyondtrust, GCP, Sentinel, CA-PAM, HP Webinspect, Burp Suite, Zscaler, Fireeye, M365, Nessus, CADO, Rapid 7, and Checkmarx.'"
      ]
     },
     "execution_count": 140,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"\"\"\n",
    "What are the names of all the tools?\n",
    "\"\"\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "id": "24e5f0da",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "ename": "ValueError",
     "evalue": "Generated Cypher Statement is not valid\n{code: Neo.ClientError.Statement.SyntaxError} {message: Variable `Tool` not defined (line 3, column 17 (offset: 55))\r\n\"RETURN DISTINCT Tool.name\"\r\n                 ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\langchain_community\\graphs\\neo4j_graph.py:113\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    112\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 113\u001b[0m     data \u001b[38;5;241m=\u001b[39m session\u001b[38;5;241m.\u001b[39mrun(query, params)\n\u001b[0;32m    114\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m [r\u001b[38;5;241m.\u001b[39mdata() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\work\\session.py:313\u001b[0m, in \u001b[0;36mSession.run\u001b[1;34m(self, query, parameters, **kwargs)\u001b[0m\n\u001b[0;32m    312\u001b[0m parameters \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mdict\u001b[39m(parameters \u001b[38;5;129;01mor\u001b[39;00m {}, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[1;32m--> 313\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\u001b[38;5;241m.\u001b[39m_run(\n\u001b[0;32m    314\u001b[0m     query, parameters, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mdatabase,\n\u001b[0;32m    315\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mimpersonated_user, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mdefault_access_mode,\n\u001b[0;32m    316\u001b[0m     bookmarks, \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mnotifications_min_severity,\n\u001b[0;32m    317\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_config\u001b[38;5;241m.\u001b[39mnotifications_disabled_categories,\n\u001b[0;32m    318\u001b[0m )\n\u001b[0;32m    320\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_auto_result\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:181\u001b[0m, in \u001b[0;36mResult._run\u001b[1;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_categories)\u001b[0m\n\u001b[0;32m    180\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39msend_all()\n\u001b[1;32m--> 181\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attach()\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:298\u001b[0m, in \u001b[0;36mResult._attach\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    297\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_attached \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mFalse\u001b[39;00m:\n\u001b[1;32m--> 298\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connection\u001b[38;5;241m.\u001b[39mfetch_message()\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    177\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m     func(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    179\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:849\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    846\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39minbox\u001b[38;5;241m.\u001b[39mpop(\n\u001b[0;32m    847\u001b[0m     hydration_hooks\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mresponses[\u001b[38;5;241m0\u001b[39m]\u001b[38;5;241m.\u001b[39mhydration_hooks\n\u001b[0;32m    848\u001b[0m )\n\u001b[1;32m--> 849\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_message(tag, fields)\n\u001b[0;32m    850\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m perf_counter()\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt5.py:374\u001b[0m, in \u001b[0;36mBolt5x0._process_message\u001b[1;34m(self, tag, fields)\u001b[0m\n\u001b[0;32m    373\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 374\u001b[0m     response\u001b[38;5;241m.\u001b[39mon_failure(summary_metadata \u001b[38;5;129;01mor\u001b[39;00m {})\n\u001b[0;32m    375\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ServiceUnavailable, DatabaseUnavailable):\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:245\u001b[0m, in \u001b[0;36mResponse.on_failure\u001b[1;34m(self, metadata)\u001b[0m\n\u001b[0;32m    244\u001b[0m Util\u001b[38;5;241m.\u001b[39mcallback(handler)\n\u001b[1;32m--> 245\u001b[0m \u001b[38;5;28;01mraise\u001b[39;00m Neo4jError\u001b[38;5;241m.\u001b[39mhydrate(\u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mmetadata)\n",
      "\u001b[1;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Variable `Tool` not defined (line 3, column 17 (offset: 55))\r\n\"RETURN DISTINCT Tool.name\"\r\n                 ^}",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[1;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[137], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m graph\u001b[38;5;241m.\u001b[39mquery(\u001b[38;5;124m'''\u001b[39m\n\u001b[0;32m      2\u001b[0m \u001b[38;5;124mMATCH (:Tool)-[:USES_TOOL]-(:Pursuit)\u001b[39m\n\u001b[0;32m      3\u001b[0m \u001b[38;5;124mRETURN DISTINCT Tool.name\u001b[39m\n\u001b[0;32m      4\u001b[0m \n\u001b[0;32m      5\u001b[0m \u001b[38;5;124m'''\u001b[39m)\n",
      "File \u001b[1;32m~\\anaconda3\\envs\\openai\\Lib\\site-packages\\langchain_community\\graphs\\neo4j_graph.py:116\u001b[0m, in \u001b[0;36mNeo4jGraph.query\u001b[1;34m(self, query, params)\u001b[0m\n\u001b[0;32m    114\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m [r\u001b[38;5;241m.\u001b[39mdata() \u001b[38;5;28;01mfor\u001b[39;00m r \u001b[38;5;129;01min\u001b[39;00m data]\n\u001b[0;32m    115\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m CypherSyntaxError \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[1;32m--> 116\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mValueError\u001b[39;00m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mGenerated Cypher Statement is not valid\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[38;5;132;01m{\u001b[39;00me\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[1;31mValueError\u001b[0m: Generated Cypher Statement is not valid\n{code: Neo.ClientError.Statement.SyntaxError} {message: Variable `Tool` not defined (line 3, column 17 (offset: 55))\r\n\"RETURN DISTINCT Tool.name\"\r\n                 ^}"
     ]
    }
   ],
   "source": [
    "graph.query('''\n",
    "MATCH (:Tool)-[:USES_TOOL]-(:Pursuit)\n",
    "RETURN DISTINCT Tool.name\n",
    "\n",
    "''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "d5a7a95a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (:Pursuit)-[:USES_TOOL]->(t:Tool)\n",
      "RETURN COUNT(DISTINCT t)\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'COUNT(DISTINCT t)': 32}]"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"\"\"\n",
    "How many different Tools are there?\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "138451e0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'COUNT(DISTINCT t)': 32}]"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "ab688e3a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (t:Tool)\n",
      "RETURN count(t) AS toolCount, collect(t.name) AS toolNames\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'toolCount': 32,\n",
       "  'toolNames': ['Trend Micro',\n",
       "   'Log Rhythm',\n",
       "   'McAfee',\n",
       "   'Thales Vormetric',\n",
       "   'Veracode',\n",
       "   'CyberArk',\n",
       "   'Azure',\n",
       "   'Okta',\n",
       "   'SPLUNK',\n",
       "   'AWS',\n",
       "   'Trend micro',\n",
       "   'CDS',\n",
       "   'AppScan',\n",
       "   'TIM TDI',\n",
       "   'crowdstrike',\n",
       "   'Venafi',\n",
       "   'Archer',\n",
       "   'Identifence',\n",
       "   'Qradar',\n",
       "   'Beyondtrust',\n",
       "   'GCP',\n",
       "   'Sentinel',\n",
       "   'CA-PAM',\n",
       "   'HP Webinspect',\n",
       "   'Burp Suite',\n",
       "   'Zscaler',\n",
       "   'Fireeye',\n",
       "   'M365',\n",
       "   'Nessus',\n",
       "   'CADO',\n",
       "   'Rapid 7',\n",
       "   'Checkmarx']}]"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.run(\"\"\"\n",
    "How many tools are there? What are their names?\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "de2c6a6b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'toolCount': 32,\n",
       "  'toolNames': ['Trend Micro',\n",
       "   'Log Rhythm',\n",
       "   'McAfee',\n",
       "   'Thales Vormetric',\n",
       "   'Veracode',\n",
       "   'CyberArk',\n",
       "   'Azure',\n",
       "   'Okta',\n",
       "   'SPLUNK',\n",
       "   'AWS',\n",
       "   'Trend micro',\n",
       "   'CDS',\n",
       "   'AppScan',\n",
       "   'TIM TDI',\n",
       "   'crowdstrike',\n",
       "   'Venafi',\n",
       "   'Archer',\n",
       "   'Identifence',\n",
       "   'Qradar',\n",
       "   'Beyondtrust',\n",
       "   'GCP',\n",
       "   'Sentinel',\n",
       "   'CA-PAM',\n",
       "   'HP Webinspect',\n",
       "   'Burp Suite',\n",
       "   'Zscaler',\n",
       "   'Fireeye',\n",
       "   'M365',\n",
       "   'Nessus',\n",
       "   'CADO',\n",
       "   'Rapid 7',\n",
       "   'Checkmarx']}]"
      ]
     },
     "execution_count": 90,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3d19e080",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "455fc3b9",
   "metadata": {},
   "outputs": [],
   "source": [
    "CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Do not limit the number of returns results unless instructed otherwise.\n",
    "\n",
    "Schema:\n",
    "{schema}\n",
    "\n",
    "The question is:\n",
    "{question}\"\"\"\n",
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "13087d8a",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_modified = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0, model=\"gpt-4-1106-preview\"), graph=graph, verbose=True,\n",
    "    #return_direct=True, \n",
    "    cypher_prompt=CYPHER_GENERATION_PROMPT\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "0e046196",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (cust36:Customer {name: \"Cust36\"})-[:PURSUES]->(:Pursuit)-[:USES_TOOL]->(tool:Tool)\n",
      "MATCH (otherCustomer:Customer)-[:PURSUES]->(:Pursuit)-[:USES_TOOL]->(tool)\n",
      "WHERE cust36 <> otherCustomer\n",
      "RETURN DISTINCT otherCustomer.name AS OtherCustomerName\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'OtherCustomerName': 'Cust64'}, {'OtherCustomerName': 'Cust99'}, {'OtherCustomerName': 'Cust1'}, {'OtherCustomerName': 'Cust67'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "output = chain_modified.run(\"\"\"\n",
    "For a Customer Cust36 find other customers using the same tool(s).\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "01212d8b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"I don't know the answer.\""
      ]
     },
     "execution_count": 115,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "output"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "551abf57",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\"Cust64\"\n",
    "\"Cust99\"\n",
    "\"Cust1\"\n",
    "\"Cust67\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "0f133a66",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "GraphCypherQAChain(verbose=True, graph=<langchain_community.graphs.neo4j_graph.Neo4jGraph object at 0x00000226E4F29250>, cypher_generation_chain=LLMChain(prompt=PromptTemplate(input_variables=['question', 'schema'], template='Task:Generate Cypher statement to query a graph database.\\nInstructions:\\nUse only the provided relationship types and properties in the schema.\\nDo not use any other relationship types or properties that are not provided.\\nDo not create a sample graph. Use the graph given to you. \\nDo not limit the number of returns results unless instructed otherwise.\\n\\nSchema:\\n{schema}\\n\\n\\nThe question is:\\n{question}'), llm=ChatOpenAI(client=<openai.resources.chat.completions.Completions object at 0x00000226EA88F890>, async_client=<openai.resources.chat.completions.AsyncCompletions object at 0x00000226EA8A33D0>, model_name='gpt-4-1106-preview', temperature=0.0, openai_api_key='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', openai_proxy='')), qa_chain=LLMChain(prompt=PromptTemplate(input_variables=['context', 'question'], template=\"You are an assistant that helps to form nice and human understandable answers.\\nThe information part contains the provided information that you must use to construct an answer.\\nThe provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\\nMake the answer sound as a response to the question. Do not mention that you based the result on the given information.\\nIf the provided information is empty, say that you don't know the answer.\\nInformation:\\n{context}\\n\\nQuestion: {question}\\nHelpful Answer:\"), llm=ChatOpenAI(client=<openai.resources.chat.completions.Completions object at 0x00000226EA88F890>, async_client=<openai.resources.chat.completions.AsyncCompletions object at 0x00000226EA8A33D0>, model_name='gpt-4-1106-preview', temperature=0.0, openai_api_key='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', openai_proxy='')), graph_schema='Node properties are the following:\\nArea {name: STRING},Tool {name: STRING},Customer {name: STRING},Pursuit {type: STRING, File_Storage: STRING, team_size: STRING, ID: STRING, Cyber_Deal_size: STRING, Date_of_Submission: STRING}\\nRelationship properties are the following:\\n\\nThe relationships are the following:\\n(:Customer)-[:PURSUES]->(:Pursuit),(:Pursuit)-[:USES_TOOL]->(:Tool),(:Pursuit)-[:AREA_COVERED]->(:Area)', return_direct=True)"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_language_example"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "8578e907",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a.name': 'SOC build'},\n",
       " {'a.name': 'AV'},\n",
       " {'a.name': 'GRC'},\n",
       " {'a.name': 'VM'},\n",
       " {'a.name': 'PAM'},\n",
       " {'a.name': 'Forensics'},\n",
       " {'a.name': 'Appsec'},\n",
       " {'a.name': 'IAM'},\n",
       " {'a.name': 'HSM'},\n",
       " {'a.name': 'L2'},\n",
       " {'a.name': 'certificate management'},\n",
       " {'a.name': 'SOC L1'},\n",
       " {'a.name': 'Cloud Security'},\n",
       " {'a.name': 'EDR'},\n",
       " {'a.name': 'IR'},\n",
       " {'a.name': 'SOC'},\n",
       " {'a.name': 'network security'},\n",
       " {'a.name': 'M365'},\n",
       " {'a.name': 'PT'}]"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query('''\n",
    "MATCH (a:Area)\n",
    "RETURN a.name\n",
    "''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5732611c",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
